Repository: RobertAmbroziak/BudgetWallet
Catalog: src/Util/Resources/AppResource.*.resx
Languages: pl

# err_codeDoesnottExistsOrExpired
source: Code doesn't exists or expired
pl: Kod nie istnieje lub jest nieważny

# err_errorAt
source: Error at
pl: Błąd w

# err_userNotFound
source: User not found
pl: Nie znaleziono użytkownika

# err_wrongUserNameOrPassword
source: Wrong user name or password.
pl: Nieprawidłowy login lub hasło

# rule_accountIdBelongsToUser
source: AccountId doesn't belong to user.
pl: AccountId nie należy do użytkownika.

# rule_budgetCannotBeNull
source: Budget can't be empty.
pl: Budżet musi być wybrany.

# rule_budgetDescMaxLong
source: Maximum length of the budget description is 200 characters.
pl: Maksymalna długość opisu budżetu to 200 znaków

# rule_budgetIdBelongsToUser
source: BudgetId doesn't belong to user.
pl: BudgetId nie należy do użytkownika.

# rule_budgetMustHaveAtLeastOneActivePeriod
source: Budget must have at least one active period.
pl: Budżet musi posiadać minimum 1 aktywny okres

# rule_budgetMustHaveAtLeastOneCategory
source: Budget must have at least one category.
pl: Budżet musi posiadać minimuj jedną budżet kategorię

# rule_budgetNameMaxLong
source: Maximum length of the budget name is 50 characters.
pl: Maksymalna długość nazwy budżetu to 50 znaków

# rule_budgetNameRequired
source: Budget name cannot be empty.
pl: Nazwa budżetu nie może być pusta

# rule_budgetValidToDateMustBeGreaterThanValidFromDate
source: Bbudget's end date must be at least one day greater than the start date.
pl: Data końcowa budżetu musi być większa o minimum 1 dzień od daty startu

# rule_categoryIdMustBeValidAndBelongToUser
source: Category ID must belong to the given user and be valid.
pl: Id kategorii musi należec do danego użytkownika i być prawidłowe

# rule_categoryIdsBelongToBudget
source: One or more categoryId doesn't belong to budget.
pl: Jeden lub więcej CategoryId nie należy do budżetu.

# rule_categoryMaxValueMustBePositive
source: Budget category value must be positive.
pl: Wartość budżet kategorii musi być dodatnia

# rule_categoryMustBelongToUser
source: Categories must belong to the current user.
pl: Kategorie muszą należeć do aktualnego użytkownika

# rule_categoryValuesMustMatch
source: Category value for the period must be specified.
pl: Suma wartość kategorii dla okresu musi być równa wartości kategorii dla budżetu

# rule_emailIsRequired
source: Email is requaired.
pl: Email jest wymagany.

# rule_emailMaxLong
source: Email cannot exceed 200 characters.
pl: Email nie może być dłuższy niż 200 znaków.

# rule_emailMinLong
source: Email must be at least 6 characters long.
pl: Email musi mieć co najmniej 6 znaków.

# rule_emailTaken
source: Email address is already taken.
pl: Adres email jest już zajęty.

# rule_firstPeriodMustMatchBudgetStart
source: First period must have a start date that matches the budget.
pl: Pierwszy okres musi mieć datę startu taką jak budżet

# rule_invalid EmailFormat
source: Invalid email address format.
pl: Nieprawidłowy format adresu email.

# rule_lastPeriodMustMatchBudgetEnd
source: Last period must have an end date that matches the budget.
pl: Ostatni okres musi mieć datę końca taką jak budżet

# rule_passwordFormat
source: Password must be at least 8 characters long, including at least one lowercase letter, one uppercase letter, one digit, and one special character.
pl: Hasło musi zawierać co najmniej 8 znaków, w tym co najmniej jedną małą literę, jedną dużą literę, jedną cyfrę oraz jeden znak specjalny.

# rule_passwordRequired
source: Password is required.
pl: Hasło jest wymagane.

# rule_periodCategoriesMustMatchBudgetCategories
source: Sum of the category values for periods must be equal to the value for the given budget category.
pl: Suma wartości kategorii okresów musi być równa wartości na danej budżet kategorii

# rule_periodMustBeAtLeastOneDay
source: Budget period must be at least one day long.
pl: Okres budżetowy musi mieć długość minimum 1 dzień

# rule_periodsMustBeSequential
source: Periods in the budget must be sequential.
pl: Okresy w budżecie muszą mieć zachowaną ciągłość

# rule_splitValuePositive
source: Split values should be positive.
pl: Wartości podziałów powinny być dodatnie.

# rule_transferDescMaxLong
source: Transfer description cannot exceed 200 characters.
pl: Maksymalna długość opisu transferu to 200 znaków.

# rule_transferNameMaxLong
source: Transfer name cannot exceed 50 characters.
pl: Maksymalna długość nazwy transferu to 50 znaków.

# rule_transferNameRequired
source: Transfer name is required.
pl: Nazwa transferu jest wymagana.

# rule_transferValueEqualsSplitSum
source: Transfer value not equals split value sum.
pl: Wartość transferu nie jest równa sumie wartości podziałów.

# rule_transferValuePositive
source: Transfer value should be positive.
pl: Wartość transferu powinna być dodatnia.

# rule_usernameMaxLong
source: Username cannot exceed 50 characters.
pl: Nazwa użytkownika nie może być dłuższa niż 50 znaków.

# rule_usernameMinLong
source: Username must be at least 3 characters long.
pl: Nazwa użytkownika musi mieć co najmniej 3 znaki

# rule_usernameRequired
source: Username is required.
pl: Nazwa użytkownika jest wymagana.

# rule_usernameTaken
source: Username is already taken.
pl: Nazwa użytkownika jest już zajęta.
